<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <link rel="stylesheet" href="../CSS/style.css">
    <link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/bootstrap@5.1.3/dist/css/bootstrap.min.css">
    <title>Topre</title>
</head>
<body>

<?php require "../blocks/header.php" ?>
<div class="container">
<h2 id="topre"><span>Topre</span></h2>
<span><img src="https://static.insales-cdn.com/files/1/476/1941980/original/TopreSwitch.jpg" alt="Переключатель Topre" width="304" height="188">
<img src="https://static.insales-cdn.com/files/1/468/1941972/original/Topre.jpg" alt="Topre схема переключателя" width="305" height="188"></span>
<p><span>Переключатели Topre – это электростатические емкостные переключатели от японской компании Topre Corporation. Впервые клавиатура Topre была
     представлена в 1983 году. У переключателя Topre следующее строение: над выпуклой резиновой прокладкой расположена клавиша, а под ней – коническая 
     стальная пружина; сама пружина, в свою очередь, размещается непосредственно над печатной платой. При том, что такие переключатели являются отдельными 
     составляющими клавиатуры, они монтируются все вместе на единую пластину. Резиновый купол – источник бóльшей части сопротивления и тактильности. </span></p>
     <p><span>Не стоит беспокоиться, что резиновая прокладка выйдет из строя или потеряет свои свойства, как может произойти у дешевых мембранных клавиатур.
         Клавиатуры с переключателями Topre служат счастливым обладателям десятилетиями. </span></p>    
         <p><span>К какой категории относятся переключатели Topre? Строение переключателей можно охарактеризовать как «гибридное»: так как в их 
            строение входит резиновая мембрана, однозначно отнести их к «механическим» вроде бы нельзя – возможно, даже термин «полумеханические» 
            не совсем корректен. Однако и «мембранными» их не назовешь – ведь у них есть пружины! </span></p>

<h3><span></span><span>Topre 30g, 45g</span></h3> 
<p>&nbsp;<img src="https://static.insales-cdn.com/files/1/2652/3533404/original/Chart_Topre3045g.jpg" alt="Topre диаграмма" width="399" height="307"></p>   
<p><span>По ощущениям сперва переключатели Topre производят впечатление улучшенных мембранных переключателей с резиновой прокладкой; затем начинает казаться, 
    что вы работаете с механическими переключателями вроде Cherry MX Red или Alps SKCM Cream Damped. Ход клавиш очень гладкий, и точка тактильности приходится 
    почти на самое начало хода. После ее преодоления сопротивление практически пропадает, из-за чего при эксплуатации клавиши, как правило, выжимаются до упора. 
    Точка срабатывания приходится на середину хода, но вы ее вряд ли почувствуете. При нажатии до упора переключатель издает характерный и звучный «цок!», и
     при возвращении в исходную позицию звук получается примерно такой же. В целом пользователи сходятся на том, что переключатели Topre работают тише большинства 
     механических переключателей и звучат приятно. </span></p>       
     <p><span>В сочетании с нехваткой тактильной обратной связи это может привести к тому, что непривычные в обращении с ними пользователи будут нажимать 
        на какие-то клавиши случайно. Эта проблема особенно актуальна для клавиатур вроде RealForce, оборудованных переключателями с разными весовыми
         коэффициентами для разных пальцев. </span></p>
<ul>
<li><span>Искушенным пользователям, которые знают чего хотят</span></li>
<li><span>Для тех, кто очень много работает за клавиатурой</span></li>
<li><span>В коллекцию</span></li>
<li><span>В любой офис, даже к раздражительным коллегам</span></li>
<li><span>Домой</span></li>
</ul>

<p>&nbsp;</p>
<p>Информация взята: <a href="https://geekboards.ru/page/switches">https://geekboards.ru/page/mechanical_switches_v2?</a></p>
</div>
<?php require "../blocks/footer.php" ?>

</body>
</html>